Revit.Application.Document
A Revit Document

Revit.Application.Document.InternalDocument
Internal reference to the Document

Revit.Application.Document.ActiveView
Get the active view for the document

Revit.Application.Document.IsFamilyDocument
Is the Document a Family?

Revit.Application.Document.Current
Get the current document
Returns:

Revit.Application.Document.Location
Extracts Latitude and Longitude from Revit
Latitude
Longitude
Latitude, Longitude